erpdev.СХК_Расширение/src/DataProcessors/Расш1_ЗаполнениеПланЕком/Расш1_ЗаполнениеПланЕком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Расш1_ЗаполнениеПланЕком</name>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/InformationRegisters/Расш1_ПланОстатокЕком/Расш1_ПланОстатокЕком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш1_ПланОстатокЕком</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>ПланОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураКонтрагента</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПлана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Catalogs/НоменклатураКонтрагентов/НоменклатураКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fb652c53-8b80-4555-a9eb-dba4d24c612d">
  <name>НоменклатураКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="891c08dd-bcea-4e09-809d-8e830642d676">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a5af94d-ca5b-4cb0-be5e-029447ca2a71">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4a5e85c8-569b-4445-9689-173b0097f527">
    <name>ВладелецНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="35dcedc2-6c02-4494-a957-999efc7f1ae7">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e389a121-b8cf-4d11-880c-d1a91f8a65c6">
    <name>ИдентификаторХарактеристикиСервиса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f6c2e5f0-1d5b-4909-b1f4-190730a95807">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08da99ab-bdc3-4fbb-b68e-98ba498e8814">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="76b8b4ff-dbbb-41af-b9d3-eece0efd384e">
    <name>НаименованиеХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e89cb1a7-1fbd-4135-b128-64ea0c73c90a">
    <name>КодНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a38082a7-b8ce-49cf-85e3-056c1cd803fc">
    <name>КодОКЕИБазовойЕдиницыИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="886b5382-1411-426f-bae0-51a8d59061d3">
    <name>НаименованиеНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2c26441-ecdb-4656-bfd2-15f5621bd867">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="68ea9c88-8801-4703-ac3e-ff587347cf04">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8250a2fc-06d1-4953-aff2-85ef6a2a9012">
    <name>МаркируемыйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="34a1357c-8d63-4c12-b663-e88abd1d7df4">
    <name>ИдентификаторУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bca5b07c-01c8-4c0b-9ed7-4810c51d3910">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4b9e71aa-206f-494a-be92-2099bc584304">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1dba536a-b803-434b-94a3-80de0cfbde3d">
    <name>КоличествоБазовойЕдиницыИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1e18d6d8-c79f-42e1-95f0-16d93af84adb">
    <name>ИдентификаторНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6130cd0e-f870-4377-baac-01dd976a0c5d">
    <name>ИдентификаторХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="813f8473-3a44-42ee-a3d0-207a403b522c">
    <name>ИдентификаторНоменклатурыСервиса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a70df8f6-ac02-4276-9b43-d9ddecb8590c">
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ddc0c50b-902b-4c26-986f-432124fb36c9">
    <name>КодПоКТРУ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a00c20c9-973b-4904-a78c-e35f010aaedd">
    <name>СтранаПроисхожденияКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d2cf1549-0976-438a-9504-853d3d737b0f">
    <name>ТипНоменклатурыФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e62b3355-31d3-43a0-959d-e6aa917457c1">
    <name>ПрослеживаемыйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e355be6-f29f-46ba-a67b-b41db62687e6">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_ПромоПродСемья</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="47d77738-1948-484f-ac39-88caf37b918b">
    <name>ДругиеШтрихкодыНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d217e494-52d2-47db-bda3-c73ad5bd093e">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СХК_Представленность</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолТТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТТ</name>
      <type>
        <types>EnumRef.СХК_ТипыТТ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/Расш1_ЗаполнениеПланЕком/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ЗаполнитьТЧ();	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТЧ()
	ТЧ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураКонтрагентов.Идентификатор КАК Идентификатор,
	               |	НоменклатураКонтрагентов.Штрихкод КАК Штрихкод,
	               |	НоменклатураКонтрагентов.Номенклатура КАК Номенклатура,
	               |	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	               |ГДЕ
	               |	НоменклатураКонтрагентов.ПометкаУдаления = &ПометкаУдаления
	               |	И НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры";
	
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);   
	Запрос.УстановитьПараметр("ВладелецНоменклатуры",Объект.Партнер);
	Рез = Запрос.Выполнить().Выбрать(); 
	
	
	
	Пока Рез.Следующий() Цикл
		Т = ТЧ.Добавить();
		Т.Номенклатура = Рез.Ссылка;
		Т.SKU = Рез.Идентификатор;
		Т.Штрихкод = Рез.Штрихкод;
		ТекущийПлан = ОстокФакт(Объект.Партнер,Рез.Ссылка); 
		Если ТекущийПлан <> "" Тогда
			Т.ТекущийПлан = ТекущийПлан;   
		Иначе
			Т.ТекущийПлан = 0 ;			
		КонецЕсли;	
	КонецЦикла;
	
	
КонецФункции


&НаСервере
Функция ОстокФакт(Партнер,Номен)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Расш1_ПланОстатокЕкомСрезПоследних.НоменклатураКонтрагента КАК Номенклатура,
	               |	Расш1_ПланОстатокЕкомСрезПоследних.ПланОстаток КАК ПланОстаток,
	               |	Расш1_ПланОстатокЕкомСрезПоследних.ДатаПлана КАК ДатаПлана
	               |ИЗ
	               |	РегистрСведений.Расш1_ПланОстатокЕком.СрезПоследних КАК Расш1_ПланОстатокЕкомСрезПоследних
	               |ГДЕ
	               |	Расш1_ПланОстатокЕкомСрезПоследних.Партнер = &Партнер
	               |	И Расш1_ПланОстатокЕкомСрезПоследних.ДатаПлана <= &Период
	               |	И Расш1_ПланОстатокЕкомСрезПоследних.НоменклатураКонтрагента = &НоменклатураКонтрагента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПлана УБЫВ";
	
	Запрос.УстановитьПараметр("Партнер",Партнер);   
	Запрос.УстановитьПараметр("Период",КонецДня(Дата));   
	Запрос.УстановитьПараметр("НоменклатураКонтрагента",Номен);
	Рез = Запрос.Выполнить().Выбрать();
	ПланОстаток = 0;
	Пока Рез.Следующий() Цикл
		ПланОстаток = Рез.ПланОстаток;
		Прервать;	
	КонецЦикла;
 	
	Возврат ПланОстаток;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	Для Каждого стр из ТЧ цикл
		НоваяЗапись = РегистрыСведений.Расш1_ПланОстатокЕком.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = Дата; 
		НоваяЗапись.ДатаПлана = Дата;
		НоваяЗапись.Партнер = Объект.Партнер;  
		НоваяЗапись.НоменклатураКонтрагента = стр.Номенклатура; 
		Если стр.План <> "" Тогда 
			НоваяЗапись.ПланОстаток = стр.План; 
		Иначе
			НоваяЗапись.ПланОстаток = стр.ТекущийПлан; 
		КонецЕсли;			
		Попытка
			НоваяЗапись.Записать(Истина);		
		Исключение 
			Сообщить(стр.Номенклатура);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере(); 
	ЗаполнитьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьТЧ();
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	ТЧ.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры
